{"keras_version": "1.1.1", "config": [{"config": {"input_dim": 400, "batch_input_shape": [null, 400], "activity_regularizer": null, "name": "dense_1", "activation": "relu", "output_dim": 400, "W_constraint": null, "init": "uniform", "W_regularizer": null, "input_dtype": "float32", "bias": true, "b_regularizer": null, "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"input_dim": null, "activity_regularizer": null, "b_constraint": null, "activation": "relu", "output_dim": 300, "W_constraint": null, "init": "uniform", "W_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"p": 0.35, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"input_dim": null, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "output_dim": 25, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}